Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/loans_and_credit/microcredit_loans.html.txt.tmx
Source language: en
Languages: ga

source: Personal Microcredit Scheme - It Makes Sense loans
ga: Scéim mhicrichreidmheasa – iasachtaí 'Luíonn sé le Ciall' ('It Makes Sense')

source: A pilot microcredit scheme was launched in over 30 credit unions in November 2015
ga: Seoladh scéim mhicrichreidmheasa i mbreis agus 30 comhar creidmheasa i mi na Samhna 2015

source: The pilot was a success and it is now being rolled out across all credit unions in the Republic of Ireland
ga: Is ionann micrichreidmheas agus suimeanna beaga airgid a thabhairt ar iasacht ar rátaí ísle úis

source: Participation by a credit union in the scheme is on a voluntary basis
ga: Tá de chuspóir na scéime seo an brath a laghdú ar iasachtóirí airgid a ghearrann rátaí an-arda úis

source: Loans under the initiative are called It Makes Sense loans
ga: Tugtar iasachtaí It Makes Sense ar iasachtaí faoin tionscnamh

source: You can get a list of participating credit unions on the itmakessenseloan.ie website
ga: Féadfaidh tú teacht ar liosta de chomhair chreidmheasa a bhfuil páirt á glacadh acu sa scéim anseo

source: It Makes Sense Loans are available to people getting a social welfare payment who may not be able to get credit from other sources
ga: Tá iasachtaí ‘It Makes Sense’ ar fáil do dhaoine a bhfuil íocaíochtaí áirithe leasa shóisialaigh á bhfáil acu a bhféadfadh nach mbeadh in ann creidmheas a fháil ó fhoinsí eile

source: You must also qualify for the Household Budget Scheme or, if your social welfare payment is paid into a bank account or a credit union account, you must agree to repay the loan standing order or direct debit
ga: Chomh maith leis sin, ní mór duit a bheith cláraithe nó cáiliú don Scéim Buiséad Teaghlaigh

source: Loan values will be between €100 and €2,000 and a maximum interest rate of 12% (12.68% APR) will apply
ga: Idir €100 agus €2,000 a bheidh luachanna iasachta agus beidh ráta uasta úis 12% (Ráta Céatadánach Bliantúil (RCB) 12.68%) i gceist

source: If you are not a member of your local credit union you can join very quickly (provided that you live in the local area) and be considered immediately for an It Makes Sense loan
ga: Mura comhalta thú de do chomhar creidmheasa áitiúil, is féidir leis an gcomhar creidmheasa comhalta a dhéanamh díot ar an láthair (a fhad agus a chónaíonn tú sa cheantar áitiúil) agus is féidir breithniú láithreach a dhéanamh ort i dtaobh iasacht ‘It Makes Sense’

source: Loans can be granted quickly, in some cases within 24 hours
ga: Is gnách go ndeonófar iasachtaí laistigh de 24 uair an chloig tar éis go ndéantar comhalta den chomhar creidmheasa thú agus tar éis duit d’iarratas ar iasacht a dhéanamh

source: An It Makes Sense loan is available to people aged over 18 who are:
ga: Tá iasacht ‘It Makes Sense’ ar fáil do dhaoine atá 18 mbliana d’aois agus níos sine:

source: • Getting a social welfare payment
ga: • A bhfuil íocaíocht leasa shóisialaigh á fáil acu

source: • Agree to repay the loan through the Household Budget Scheme or by standing order or direct debit if your social welfare payment is paid into a bank or credit union account
ga: • Atá cláraithe le nó a cháilíonn don Scéim Buiséad Teaghlaigh

source: You can apply for a loan for any purpose, including repayment of an outstanding debt
ga: Féadfaidh tú iarratas a dhéanamh ar iasacht ar chuspóir ar bith, aisíocaíocht aon fhiachais gan íoc, ina measc

source: You can take out a loan for a minimum period of one month up to a maximum of 2 years
ga: Féadfaidh tú iasacht a ghlacadh amach ar feadh tréimhse íosta idir mí amháin agus a mhéid le 2 bhliain

source: The minimum loan amount is €100 and the maximum amount you can borrow is €2,000
ga: Is ionann íosmhéid na hiasachta agus €100 agus is é €2,000 an méid uasta is féidir leat a fháil ar iasacht

source: Loan repayments are made from deductions each week from your social welfare payment via the Household Budget Scheme or by direct debit or standing order from your bank or credit union account
ga: Déantar aisíocaíochtaí iasachta ó asbhaintí gach seachtain ó d’íocaíocht leasa shóisialaigh tríd an Scéim Buiséad Teaghlaigh

source: The maximum deduction allowed under the Household Budget Scheme is 25% of your weekly social welfare payment
ga: Is ionann an asbhaint uasta a cheadaítear faoin Scéim Buiséad Teaghlaigh agus 25% de d’íocaíocht sheachtainiúil leasa shóisialaigh

source: This includes any other deductions that you may have under the Household Budget Scheme (for example, for rent or for household bills)
ga: Áirítear leis seo aon asbhaintí eile a d’fhéadfadh bheith agat faoin Scéim Buiséad Teaghlaigh (mar shampla, le haghaidh cíosa nó billí teaghlaigh)

source: The maximum interest rate that credit unions will charge for an It Makes Sense loan is 1% a month or 12% a year (12.68% APR)
ga: Is ionann an ráta uasta úis a ghearrfaidh comhair chreidmheasa ar iasacht ‘It Makes Sense loan’ agus 1% sa mhí nó 12% sa bhliain (Ráta Céatadánach Bliantúil (RCB) 12.68%)

source: │For a €500 loan │APR │Term │Weekly repayments │Interest charged │Total repaid │
ga: I dtaobh iasacht €500 RCB Téarma Aisíocaíochtaí seachtainiúla Ús a gearradh An tIomlán a aisíocadh

source: │ │12.68% (variable) │6 months │€19.84 │€15.84 │€515.84 │
ga: 12.68% (athraitheach) 6 mhi €19.84 €15.72 €515.72

source: │The It Makes Sense loan │ │ │ │ │ │
ga: Iasacht ‘It Makes Sense’

source: You apply for an It Makes Sense loan through your local credit union. The decision to grant a loan remains entirely with the participating credit union
ga: Déanann tú iarratas ar iasacht ‘It Makes Sense’ trí do chomhar creidmheasa áitiúil

source: Joining the credit union
ga: Bheith i do chomhalta den chomhar creidmheasa

source: If you are not already a member of the credit union you need to provide evidence of your name, address and PPS number
ga: Mura comhalta cheana féin thú den chomhar creidmheasa, is gá duit fianaise a sholáthar i dtaobh d’ainm, seolta agus uimhir PSP

source: • Proof of your identity - for example, a current passport, driving licence or Public Services Card
ga: • Cruthúnas i dtaobh d’aitheantais – mar shampla, pas reatha, ceadúnas tiomána nó Cárta Seirbhísí Poiblí

source: • Proof of your address - for example, a recent household bill or recent Government-issued documentation such as a letter from the Department of Social Protection
ga: • Cruthúnas i dtaobh do sheolta – mar shampla, bille teaghlaigh a eisíodh le déanaí nó cáipéisíocht a d’eisigh an Rialtas le déanaí, ar nós litreach ón Roinn Coimirce Sóisialaí

source: Applying for an It Makes Sense loan
ga: Iarratas a dhéanamh ar Iasacht ‘It Makes Sense’

source: You need to bring 2 consecutive social welfare slips (from within the previous 4 weeks) if you collect your weekly payment at the post office or 2 months bank/credit union statements if you receive your social welfare payment into a bank or credit union account to your credit union
ga: Is gá duit 2 dhuillín leasa shóisialaigh a eisíodh le déanaí a thabhairt leat (a eisíodh tráth nach faide ná 4 seachtaine roimhe sin) go dtí do chomhar creidmheasa

source: Your local credit union will help you fill out a loan application form and complete the form to allow deductions from the household budget scheme
ga: Cabhróidh do chomhar creidmheasa áitiúil leat foirm iarratais ar iasacht a líonadh agus an fhoirm a chomhlánú lena cheadú asbhaintí ón scéim buiséad teaghlaigh a dhéanamh

source: The loan is available at over 30 credit unions and the number of credit unions participating will increase as more credit unions join the scheme
ga: Tá na hiasachtaí seo ar fáil ag os cionn 30 ionad comhar creidmheasa

source: You can visit facebook.com/itmakessenseloan to find out more
ga: Féadfaidh tú cuairt a thabhairt ar facebook.com/itmakessenseloan chun teacht ar níos mó faisnéise

source: The website itmakessenseloan.ie has a list of participating credit unions
ga: Chomh maith leis sin, féadfaidh tú rochtain a fháil ar liosta comhair chreidmheasa rannpháirteacha ar láithreán gréasáin itmakessenseloan.ie
